# FaceDetailNode Class

---
C#Visual BasicVisual C++
Revit 2024 API
---
FaceDetailNode Class
Members See Also
---
A base class of output nodes that represent face edges and face silhouettes.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2020
# Syntax
C#
---
```text
public class FaceDetailNode : RenderNode
```

Visual Basic
---
```text
Public Class FaceDetailNode _
	Inherits RenderNode
```

Visual C++
---
```text
public ref class FaceDetailNode : public RenderNode
```

# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB..::..RenderNode Autodesk.Revit.DB..::..FaceDetailNode Autodesk.Revit.DB..::..FaceEdgeNode Autodesk.Revit.DB..::..FaceSilhouetteNode
# See Also
FaceDetailNode Members
Autodesk.Revit.DB Namespace